# dba

## 파일 시스템 활용

In [ ]:
# 함수, 슈도 코드

def summarize():
    #파일 이름을 입력 받는다.
    #파일을 읽기모드로 열어 한 줄씩 파일을 읽는다. 
    #파일의 각 행의 데이터 속성을 갖는 인스턴스 객체(사원객체)를 만든다. 
      # 사전에 employee 클래스 설계 필요!
      # 사전에 인스턴스 사원 객체를 만드는 함수 필요!  
    #월급이 가장 높은 사원을 찾는 코드를 구현한다. 
    #결과를 출력한다. 
    pass

In [3]:
#클래스 설계
class Employee:
    def __init__(self, name, division, jobgrade,years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)

In [4]:
# 인스턴스 생성.
E1 = Employee("안태희","개발팀","3","1","350")
E1.division

'개발팀'

In [9]:
# 인스턴스 생성함수 정의
def make_employee(inputdata):
    name, division,jobgrade, year , basic = inputdata.split(',')
    return Employee(name,division, jobgrade, year,basic)

In [10]:
# 파일 불러와서 객체 생성...
import os

file_path = "./f-27-data/employeefile.txt"
#file_path= os.getenv("HOME") + "/aiffel/AIFFEL_LSG/lms/F15-db/f-27-data/employeefile.txt"

inputfile = open(file_path, 'r')

for i in inputfile:
    e = make_employee(i)

In [12]:
# Employee 클래스 getter 함수 추가
class Employee:
    def get_name(self):
        return self.name
    def get_division(self):
        return self.division
    def get_jobgrade(self):
        return self.jobgrade
    def get_years(self):
        return self.years
    def get_basic(self):
        return self.basic

In [ ]:
# 급여 함수 제작
# 급여는 기본급여+기본급여 * 10% * 근속년수 
def salary(basic, year):
    return basic + (basic* 0.1 * year)

In [19]:
# e <클래스 및 함수 전 체 재정의
import os

class Employee:
    def __init__ (self, name, division, jobgrade, years, basic):
        self.name = name
        self.division = division
        self.jobgrade = int(jobgrade)
        self.years = int(years)
        self.basic = float(basic)
        self.salary = 0

    def get_name(self):
        return self.name

    def get_division(self):
        return self.division
    
    def get_jobgrade(self):
        return self.jobgrade
    
    def get_years(self):
        return self.years
    
    def get_basic(self):
        return self.basic

    def get_salary(self):
        self.salary = self.basic + (self.basic * self.years * 0.1)
        return self.salary

def make_employee(inputdata):
    name, division, jopgrade, year, basic = inputdata.split(',')
    return Employee(name, division, jopgrade, year, basic)

def summarize():
    #file_path= os.getenv("HOME") + "/aiffel/AIFFEL_LSG/lms/F15-db/f-27-data/employeefile.txt"
    file_path="./f-27-data/employeefile.txt"
    inputfile = open(file_path, 'r')
    highest = make_employee(inputfile.readline())
    for l in inputfile:
        e = make_employee(l)
        if e.get_salary() > highest.get_salary():
            highest = e
    inputfile.close()
    
    print("The name of the highest salary employee is: ", highest.get_name())
    print("Years of service: ", highest.get_years())
    print("Division: ", highest.get_division())
    print("Salay: ", highest.get_salary())

In [20]:
summarize()

The name of the highest salary employee is:  Kim YoungJae
Years of service:  7
Division:   Sales
Salay:  1020.0

## pandas csv

- merge, join concat

### merge()

In [24]:
# merge()
import pandas as pd 

df1 = pd.DataFrame({
'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]
})

df2 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Math': [100, 55, 38, 43, 68, 82]})

print(df1)
print('-------------------------------------')
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
-------------------------------------
       Student  Math
0    KimTaemin   100
1     HaJaehwa    55
2  JungSayoung    38
3     Sonjimin    43
4    Leesoomin    68
5      KangJun    82

In [25]:
pd.merge(df1, df2)
# 공통 필드 Student 기준으로 key

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [26]:
pd.merge(df1, df2, on='Student') 
# key 지정 가능

       Student  Korean  English  Math
0    KimTaemin      90       80   100
1     HaJaehwa      85       90    55
2  JungSayoung      88       40    38
3     Sonjimin      35       44    43
4    Leesoomin      40       55    68
5      KangJun      44       90    82

In [27]:
# 일부만 겹칠 경우...

df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','KimTaemin'],
                    'Math':[44,33]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Math
0  Jiyoungmin    44
1   KimTaemin    33

In [28]:
# 공통 데이터만 합치는 join inner join
pd.merge(df1, df2, how='inner')

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [29]:
# 미지정 시 기본 으로 innter
pd.merge(df1, df2)

     Student  Korean  English  Math
0  KimTaemin      90       80    33

In [30]:
# outter join
pd.merge(df1, df2, how='outer')

       Student  Korean  English  Math
0    KimTaemin    90.0     80.0  33.0
1     HaJaehwa    85.0     90.0   NaN
2  JungSayoung    88.0     40.0   NaN
3     Sonjimin    35.0     44.0   NaN
4    Leesoomin    40.0     55.0   NaN
5      KangJun    44.0     90.0   NaN
6   Jiyoungmin     NaN      NaN  44.0

### join()

In [31]:
df1.join(df2, how='outer', lsuffix='_caller', rsuffix='_other')  
# '_caller'인 df1 컬럼이 왼쪽에 가도록 배치

  Student_caller  Korean  English Student_other  Math
0      KimTaemin      90       80    Jiyoungmin  44.0
1       HaJaehwa      85       90     KimTaemin  33.0
2    JungSayoung      88       40           NaN   NaN
3       Sonjimin      35       44           NaN   NaN
4      Leesoomin      40       55           NaN   NaN
5        KangJun      44       90           NaN   NaN

### concat

- 이어 붙이기

In [33]:
df1 = pd.DataFrame({'Student': ['KimTaemin','HaJaehwa','JungSayoung','Sonjimin','Leesoomin','KangJun'],
                    'Korean': [90, 85, 88, 35, 40, 44],
                    'English': [80, 90, 40, 44, 55, 90]})
df2 = pd.DataFrame({'Student': ['Jiyoungmin','LeeJae','KimJaehee'],
                    'Korean': [44,73,100]})

print(df1)
print(df2)

       Student  Korean  English
0    KimTaemin      90       80
1     HaJaehwa      85       90
2  JungSayoung      88       40
3     Sonjimin      35       44
4    Leesoomin      40       55
5      KangJun      44       90
      Student  Korean
0  Jiyoungmin      44
1      LeeJae      73
2   KimJaehee     100

In [34]:
pd.concat([df1,df2], sort=False)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
0   Jiyoungmin      44      NaN
1       LeeJae      73      NaN
2    KimJaehee     100      NaN

In [35]:
#index renewal
pd.concat([df1, df2], sort=False, ignore_index=True)

       Student  Korean  English
0    KimTaemin      90     80.0
1     HaJaehwa      85     90.0
2  JungSayoung      88     40.0
3     Sonjimin      35     44.0
4    Leesoomin      40     55.0
5      KangJun      44     90.0
6   Jiyoungmin      44      NaN
7       LeeJae      73      NaN
8    KimJaehee     100      NaN

![](./imgs/00-join.png)

## pandas 기능 ....

### 필터링 연산

In [116]:
#frame create
df = pd.DataFrame({"A": [1,4,7], "B": [2,5,8], "C":[3,6,9]})

df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [117]:
# df['칼럼명'] 형식 사용
df['A']

0    1
1    4
2    7
Name: A, dtype: int64

In [118]:
#df.loc[[행],[열]]
df.loc[[1],['A']]

   A
1  4

In [119]:
# 0번재 행 다출력
print(df.loc[0])

A    1
B    2
C    3
Name: 0, dtype: int64

In [120]:
# 0번재 행 B 값 출력
print(df.loc[0, 'B'])

2

In [121]:
#모든행의 "A" 만 출력
print(df.loc[:, 'A'])

0    1
1    4
2    7
Name: A, dtype: int64

In [112]:
# 0번째 모두 출력
print(df.iloc[0])

Columns1     A
Columns2    10
Name: 0, dtype: object

In [113]:
#모든 행의 0번째 열 출력
print(df.iloc[:, 0])

0    A
1    A
2    B
3    B
4    C
5    C
6    A
7    B
Name: Columns1, dtype: object

In [114]:
# 문자 사용 노노에러남. iloc[ ]

### 그룹 연산

#### groupby() 연산 메커니즘
- groupby()객체를 생성
- groupby()객체의 연산을 수행
- max(), min(), sum(), mean()
- + apply() 메소드를 통해 특수 수식에 대한 연산을 수행할 수 있습니다.

In [47]:
df = pd.DataFrame({'Columns1':['A','A','B','B','C','C','A','B'],
                   'Columns2':[10, 2, 30, -6, 8, 9, 5, 2]})

df

  Columns1  Columns2
0        A        10
1        A         2
2        B        30
3        B        -6
4        C         8
5        C         9
6        A         5
7        B         2

In [48]:
import numpy as  np
df.groupby(['Columns1']).max().apply(np.sqrt)

          Columns2
Columns1
A         3.162278
B         5.477226
C         3.000000

### pandas - Transform

In [55]:
import pandas as pd
import numpy as np

#file_path = os.getenv("HOME") + '/aiffel/data_handling/data/Salaries.csv'
file_path = './f-27-data/Salaries.csv'
sal = pd.read_csv(file_path)
sal

/home/aiffel0042/anaconda3/envs/aiffel/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3072: DtypeWarning: Columns (12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

            Id           EmployeeName  ...         Agency  Status
0            1         NATHANIEL FORD  ...  San Francisco     NaN
1            2           GARY JIMENEZ  ...  San Francisco     NaN
2            3         ALBERT PARDINI  ...  San Francisco     NaN
3            4      CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5        PATRICK GARDNER  ...  San Francisco     NaN
...        ...                    ...  ...            ...     ...
148640  148641     Charlene D Mccully  ...  San Francisco      PT
148641  148642  Raphael Marquis Goins  ...  San Francisco      PT
148642  148643      Dominic C Marquez  ...  San Francisco      PT
148643  148644             Kim Brewer  ...  San Francisco      PT
148644  148645           Randy D Winn  ...  San Francisco      PT

[148645 rows x 13 columns]

In [59]:
# 문제ㅂq1. 평균 basepay 는?
sal.loc[:,"BasePay"].mean()

66327.6889596918

In [60]:
# Q2 overtime pay 최댓값
sal.loc[:, "OvertimePay"].max()

245131.88

In [81]:
#q3.
print ( sal[sal["EmployeeName"] == "JOSEPH DRISCOLL"].loc[:, "JobTitle"])

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [99]:
sal[sal["EmployeeName"]=="JOSEPH DRISCOLL"]

    Id     EmployeeName                   JobTitle  ...  Notes         Agency  Status
24  25  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION  ...    NaN  San Francisco     NaN

[1 rows x 13 columns]

In [122]:
sal[sal["EmployeeName"]=="JOSEPH DRISCOLL"].iloc[:, 3]+sal[sal["EmployeeName"]=="JOSEPH DRISCOLL"].iloc[:, 4]+sal[sal["EmployeeName"]=="JOSEPH DRISCOLL"].iloc[:, 5]

24    270324.91
dtype: float64

In [125]:
sal[sal["EmployeeName"]=="JOSEPH DRISCOLL"]

    Id     EmployeeName                   JobTitle  ...  Notes         Agency  Status
24  25  JOSEPH DRISCOLL  CAPTAIN, FIRE SUPPRESSION  ...    NaN  San Francisco     NaN

[1 rows x 13 columns]

In [145]:
#q5 월 급 짱

sal[sal['TotalPayBenefits']  == sal['TotalPayBenefits'].max()]

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

In [132]:
# 월급 거지
sal[sal['TotalPayBenefits']  == sal['TotalPayBenefits'].min()]

            Id   EmployeeName          JobTitle  ...  Notes         Agency  Status
110530  110531  David P Kucia  Police Officer 3  ...    NaN  San Francisco     NaN

[1 rows x 13 columns]

In [146]:
# 11년 ~ 14년 연도별 basepay 평균
sal.groupby(["Year"]).mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66573.154204
Name: BasePay, dtype: float64

In [150]:
sal["JobTitle"].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [199]:
#q10
# chief 글자 포함여부 조회 함수.
def chief_string(str):
    if str.lower().find("chief") != -1:
        return 1
    else:
        return 0


a = sal['JobTitle'].apply(lambda x : chief_string(x))
sum(a)

627

In [198]:
def chief_string(title):
    if 'chief' in title.lower().split(): 
        return True
    else:
        return False
sum(sal['JobTitle'].apply(lambda x : chief_string(x)))

477

In [201]:
title= 'echiefe dchiefd'

if 'chief' in title.lower().split(): 
    print("t")
else:
    print("f")
    
if title.lower().find('chief') != -1 : 
    print("t")
else:
    print("f")

f
t